import pandas as pd
import pytest


@pytest.fixture
def sample_df() -> pd.DataFrame:
    return pd.DataFrame(
        [
            {
                "Дата операции": "05.08.2026",
                "Описание": "Магнит",
                "Категория": "Супермаркеты",
                "Сумма операции": -1500,
            },
            {"Дата операции": "10.08.2026", "Описание": "Ситидрайв", "Категория": "Каршеринг", "Сумма операции": -300},
            {
                "Дата операции": "15.08.2026",
                "Описание": "Галамарт",
                "Категория": "Дом и ремонт",
                "Сумма операции": -2350,
            },
            {
                "Дата операции": "20.08.2026",
                "Описание": "Пополнение через Газпромбанк",
                "Категория": "Пополнения",
                "Сумма операции": 5000,
            },
        ]
    )
